v2206/multiphase_solverComparisons/bubbleColumnEuler/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.gas 1
    volScalarFieldValue alpha.liquid 0
);

regions
(
    // boxToCell
    // {
    //     box (0 0 0) (0.15 0.501 0.1);
    //     fieldValues
    //     (
    //         volScalarFieldValue alpha.gas 0.01
    //         volScalarFieldValue alpha.liquid 0.99
    //     );
    // }

    boxToCell
    {
        box (0 0 0) (1 0.12 1);
        fieldValues
        (
            volScalarFieldValue alpha.liquid    1
            volScalarFieldValue alpha.gas       0
            // volScalarFieldValue T               298.15
        );
    }

    // sphereToCell
    // {
    //     centre (0.02 0.02 0.0001);
    //     radius 0.003;
    //     fieldValues
    //     (
    //         volScalarFieldValue alpha.liquid    0
    //         volScalarFieldValue alpha.gas       1
    //         // volScalarFieldValue T               298.15
    //     );
    // }
);


// ************************************************************************* //
