v2206/multiphase_solverComparisons/bubbleColumnEuler/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

canCompile || exit 0    # Dynamic code

# restore0Dir

# runApplication blockMesh

# runApplication setFields

# runApplication $(getApplication)

restore0Dir

runApplication blockMesh

runApplication setFields

touch foam.foam

# runApplication $(getApplication)

runApplication decomposePar

runParallel $(getApplication)

runApplication reconstructPar

rm -r proc*

#------------------------------------------------------------------------------
